InformationRegisters/Треки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Треки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправленоУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Трек</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерТрека</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Перевозчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Перевозчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Перевозчики</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AirIndia</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DHL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EtihadAirlines</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EmiratesSkyCargo</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Fedex</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>KoreanAirlines</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QantasAirlines</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SingaporeAirlines</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TurkishAirlines</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UPS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИнвойсЗакупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИнвойсЗакупки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПлатежныйКалендарьЗакупки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНаСкладеОтправителя</Name>
					<Comment>Дата на складе отправителя</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнспекции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоИнспектировал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авианакладная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛокальныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплатыВВалютеИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТТН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Перевозчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетдыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>11</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеИнвойса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Треки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Трек</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>22</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ОбменСВнешнимиИсточниками/Ext/Module.bsl
Процедура ОбменТелеграм() Экспорт 
	
КонецПроцедуры	

Процедура ОтслеживаниеТреков() Экспорт 

	ПроверкаТрековДХЛ();
	ПроверкаТрековФедекс();
	
КонецПроцедуры	


#Область DHL

Процедура ПроверкаТрековДХЛ()
	
	ТекстДХЛ = "";
	СтатусДоставлено = "delivered";
	//Токен = "7633822212:AAGpRpvXlxB1OvzbDRTNBt1tOT5RvARUZK4"; 
	Токен = Константы.ТокенЧатаТреков.Получить();
	//ИдЧата = "-1002280760609";
	ИдЧата = Константы.ИдЧатаТреков.Получить();
	
	// 1. запишем в РС актуальные треки   
	
	запр = Новый Запрос;    
	запр.УстановитьПараметр("Дата", ДобавитьМесяц(ТекущаяДатаСеанса(), -1)); 
	запр.УстановитьПараметр("Перевозчик", Перечисления.Перевозчики.DHL); 
	запр.Текст = "ВЫБРАТЬ различные
	             |	ИнвойсЗакупкиТреки.Трек КАК Трек,
	             |	ИнвойсЗакупкиТреки.Дата КАК Дата
	             |ПОМЕСТИТЬ тз
	             |ИЗ
	             |	Документ.ИнвойсЗакупки.Треки КАК ИнвойсЗакупкиТреки
	             |ГДЕ
	             |	НЕ ИнвойсЗакупкиТреки.Ссылка.ПометкаУдаления
	             |	И ИнвойсЗакупкиТреки.Ссылка.Дата > &Дата
	             |	И ИнвойсЗакупкиТреки.Ссылка.Перевозчик = &Перевозчик
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	тз.Трек КАК Трек,
	             |	тз.Дата КАК Дата,
	             |	РСТреки.Трек КАК ТрекРС
	             |ИЗ
	             |	тз КАК тз
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			РСТреки.Трек КАК Трек
	             |		ИЗ
	             |			РегистрСведений.Треки КАК РСТреки
	             |		ГДЕ
	             |			РСТреки.Перевозчик = &Перевозчик) КАК РСТреки
	             |		ПО тз.Трек = РСТреки.Трек
	             |ГДЕ
	             |	РСТреки.Трек ЕСТЬ NULL";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.Треки.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Перевозчик.Установить(Перечисления.Перевозчики.DHL); 
		НаборЗаписей.Отбор.Трек.Установить(Выборка.Трек); 
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Перевозчик 				= Перечисления.Перевозчики.DHL;   
		НоваяЗапись.Трек 					= Выборка.Трек;  
		НоваяЗапись.Статус 					= "";  
		НоваяЗапись.ОтправленоУведомление 	= Ложь;     
		НоваяЗапись.Ответ					= "";
		НаборЗаписей.Записать(); 
		Сообщить("найдено в инвойсах " + Выборка.Трек);
	КонецЦикла;
	
	// 2. Запишем ответы сервера ДХЛ (по всем недоставленным трекам) в РС
	
	Запр = Новый Запрос;
	запр.УстановитьПараметр("Перевозчик", Перечисления.Перевозчики.DHL); 
	запр.УстановитьПараметр("Статус", СтатусДоставлено); 
	Запр.Текст = "ВЫБРАТЬ
	             |	Треки.Трек КАК Трек
	             |ИЗ
	             |	РегистрСведений.Треки КАК Треки
	             |ГДЕ
	             |	Треки.Перевозчик = &Перевозчик
	             |	И Треки.Статус <> &Статус";       
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Ответ = ОтветДХЛ(Выборка.Трек);	
		Если Ответ.Отказ Тогда                                                                                  
			тлгДействия.ОтправитьТекстовоеСообщение(Токен, ИДЧата, стрШаблон("Ошибка %1: трек %2 (%3)", Ответ.Код, Выборка.Трек, Ответ.СообщениеПользователю));
			Продолжить;
		КонецЕсли;

		НаборЗаписей = РегистрыСведений.Треки.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Перевозчик.Установить(Перечисления.Перевозчики.DHL); 
		НаборЗаписей.Отбор.Трек.Установить(Выборка.Трек); 
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Перевозчик 				= Перечисления.Перевозчики.DHL;   
		НоваяЗапись.Трек 					= Выборка.Трек;  
		НоваяЗапись.Статус 					= Ответ.Статус;  
		НоваяЗапись.ОтправленоУведомление 	= Ложь;     
		НоваяЗапись.Ответ 					= Ответ.СообщениеПользователю;
		НаборЗаписей.Записать(); 
		Сообщить("записан ответ трека " + Выборка.Трек);
		
		Пауза(3);
		
	КонецЦикла;
	
	// 3.  отправим сообщениx в тлг
	
	Запр = Новый Запрос;
	запр.УстановитьПараметр("Перевозчик", Перечисления.Перевозчики.DHL); 
	запр.УстановитьПараметр("Статус", СтатусДоставлено); 
	Запр.Текст = "ВЫБРАТЬ
	             |	Треки.Трек КАК Трек,
	             |	Треки.Статус КАК Статус,
	             |	ВЫРАЗИТЬ(Треки.Ответ КАК СТРОКА(500)) КАК Ответ
	             |ИЗ
	             |	РегистрСведений.Треки КАК Треки
	             |ГДЕ
	             |	Треки.Перевозчик = &Перевозчик
	             |	И НЕ Треки.ОтправленоУведомление";  
	РезультатЗапроса = Запр.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		тлгДействия.ОтправитьТекстовоеСообщение(Токен, ИДЧата, "Проверка статусов *DHL*: в 1С нет отслеживаемых треков DHL"); 
		
	Иначе
		
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстДХЛ = ТекстДХЛ + СтрШаблон("*Track* %1: status '%2' %3", Выборка.трек, ВРег(Выборка.Статус), Выборка.Ответ) + Символы.ПС + Символы.ПС;  
			
			НаборЗаписей = РегистрыСведений.Треки.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Перевозчик.Установить(Перечисления.Перевозчики.DHL); 
			НаборЗаписей.Отбор.Трек.Установить(Выборка.Трек); 
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Перевозчик 				= Перечисления.Перевозчики.DHL;   
			НоваяЗапись.Трек 					= Выборка.Трек;  
			НоваяЗапись.Статус 					= Выборка.Статус;  
			НоваяЗапись.ОтправленоУведомление 	= Истина;     
			НоваяЗапись.Ответ 					= Выборка.Ответ;
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
		тлгДействия.ОтправитьКартинку(Токен, ИдЧата, "Проверка статусов *DHL*", БиблиотекаКартинок.dhl_logo.ПолучитьДвоичныеДанные(), );
		тлгДействия.ОтправитьТекстовоеСообщение(Токен, ИДЧата, ТекстДХЛ); 
		
	КонецЕсли;

КонецПроцедуры

Функция ОтветДХЛ(НомерТрека)

	ИмяСервера 	= "api-eu.dhl.com";

	Заголовки = Новый Соответствие;    
    Заголовки.Вставить("Accept", 		"application/json");
    //Заголовки.Вставить("DHL-API-Key", 	"JaowVB7MmnZ8xCyLBTQAr6YnB5Aqi2rX");
    Заголовки.Вставить("DHL-API-Key", 	Константы.ТокенДХЛ.Получить());

	Запрос = Новый HTTPЗапрос();
	Запрос.АдресРесурса = "/track/shipments?trackingNumber=" + СокрЛП(НомерТрека);
	Запрос.Заголовки = Заголовки;
	
	Соединение = Новый HTTPСоединение(ИмяСервера,,,,,,Новый ЗащищенноеСоединениеOpenSSL()); 
	Ответ = Соединение.Получить(Запрос);
	КодСостояния = Ответ.КодСостояния;  
	Сообщить(НомерТрека + " КодСостояния: " + КодСостояния);
	Если КодСостояния = 200 Тогда
		
		СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();	
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
		
		СтруктураОтвет = Неопределено;
		РазобратьJSONРекурсия(ЧтениеJSON, СтруктураОтвет);  
		СтруктураОтвет = СтруктураОтвет.shipments[0];
		СтруктураСтатус = СтруктураОтвет.status;
		КодСтатуса 		= СтруктураОтвет.status.status;
		//ОжидаемаяДата   = СтруктураОтвет.shipments[0].estimatedTimeOfDelivery;
		//ОжидаемоеВремя  = СтруктураОтвет.shipments[0].estimatedTimeOfDeliveryRemark;
		//
		//Статус 			= СтруктураСтатус.description;
		//ДатаВремя 		= СтруктураСтатус.timestamp;
		//АдресДоставки 	= СтруктураСтатус.location.addressLocality;
		
		Если КодСтатуса = "101" Тогда	
			Статус = "delivered";
			СообщениеПользователю = "";
		ИначеЕсли КодСтатуса = "102" Тогда	
			Статус = НРег(СтруктураСтатус.description);
			Если Статус = "delivered" Тогда
				СообщениеПользователю = "прибыл " + СтруктураСтатус.timestamp;
			Иначе
				Если СтруктураОтвет.Свойство("estimatedTimeOfDelivery") Тогда
					ОжидаемаяДата   = СтруктураОтвет.estimatedTimeOfDelivery;
					ОжидаемоеВремя  = СтруктураОтвет.estimatedTimeOfDeliveryRemark;
					СообщениеПользователю = СтрШаблон("ожидаемое прибытие %1 %2", ОжидаемаяДата, ОжидаемоеВремя);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли КодСтатуса = "103" Тогда	
			Статус = "failure";
			Опис = СтруктураСтатус.description; 
			Прим = СтруктураСтатус.remark;
			СледШаг = СтруктураСтатус.nextSteps;
			СообщениеПользователю = СтрШаблон("%1. %2", Опис, Прим);
		ИначеЕсли КодСтатуса = "104" Тогда	
			СообщениеПользователю = "";
			Статус = "pre-transit";
		Иначе     
			Статус = "<неизвестен>";
			СообщениеПользователю = "";
		КонецЕсли;
		
		Возврат Новый Структура("Статус,СообщениеПользователю,Код,Отказ", Статус, СообщениеПользователю, КодСостояния, Ложь);
		
	ИначеЕсли КодСостояния = 404 тогда
		
		Возврат Новый Структура("Статус,СообщениеПользователю,Код,Отказ", "unknown", "Сервер не отвечает", КодСостояния, Истина);
		
	ИначеЕсли КодСостояния = 429 тогда
		
		Возврат Новый Структура("Статус,СообщениеПользователю,Код,Отказ", "too much requests", "Слишком много запросов", КодСостояния, Истина);

	ИначеЕсли КодСостояния = 500 тогда
		
		Возврат Новый Структура("Статус,СообщениеПользователю,Код,Отказ", "unknown", "Сервер не отвечает", КодСостояния, Истина);

	Иначе
		
		Возврат Новый Структура("Статус,СообщениеПользователю,Код,Отказ", "error", "Ошибка сервера", КодСостояния, Истина);
		
	КонецЕсли;
	
КонецФункции 

#КонецОбласти


#Область Fedex

Процедура ПроверкаТрековФедекс() Экспорт
	
	Перем ТрекНомер;
	
	
    // 1. Параметры подключения
    ИмяСервера = "apis.fedex.com"; // Для теста используйте apis-sandbox.fedex.com
    APIKey     = "ВАШ_API_KEY";
    SecretKey  = "ВАШ_SECRET_KEY";
    AccountNum = "ВАШ_ACCOUNT_NUMBER";

    // 2. Получение Токена (OAuth2)
    Токен = ПолучитьТокенFedex(ИмяСервера, APIKey, SecretKey);
    Если Токен = Неопределено Тогда
        Возврат;
    КонецЕсли;

    // 3. Формирование тела запроса для отслеживания
    СтруктураЗапроса = Новый Структура;
    СтруктураЗапроса.Вставить("includeDetailedScans", Истина);
    
    МассивТреков = Новый Массив;
    МассивТреков.Добавить(Новый Структура("trackingNumber", ТрекНомер));
    
    ИнформацияОбОтслеживании = Новый Структура;
    ИнформацияОбОтслеживании.Вставить("trackingInfo", МассивТреков);
    
    СтруктураЗапроса.Вставить("trackingInfoList", ИнформацияОбОтслеживании);

    // Сериализация в JSON
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);
    СтрокаJSON = ЗаписьJSON.Закрыть();

    // 4. Выполнение HTTP-запроса
    HTTPСоединение = Новый HTTPСоединение(ИмяСервера, 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
    
    Запрос = Новый HTTPЗапрос("/track/v1/trackingnumbers");
    Запрос.Заголовки.Вставить("Content-Type", "application/json");
    Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);
    Запрос.УстановитьТелоИзСтроки(СтрокаJSON);

    Попытка
        Ответ = HTTPСоединение.ОтправитьДляОбработки(Запрос);
        Если Ответ.КодСостояния = 200 Тогда
            ЧтениеJSON = Новый ЧтениеJSON;
            ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
            Результат = ПрочитатьJSON(ЧтениеJSON);
            ЧтениеJSON.Закрыть();
            
            // Здесь обрабатываем результат (например, выводим статус)
            Сообщить("Статус посылки: " + Результат.output.completeTrackResults[0].trackResults[0].latestStatusDetail.description);
        Иначе
            Сообщить("Ошибка запроса: " + Ответ.КодСостояния + " " + Ответ.ПолучитьТелоКакСтроку());
        КонецЕсли;
    Исключение
        Сообщить("Ошибка связи: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

Функция ПолучитьТокенFedex(ИмяСервера, APIKey, SecretKey)
	
	HTTPСоединение = Новый HTTPСоединение(ИмяСервера, 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
    Запрос = Новый HTTPЗапрос("/oauth/token");
    Запрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
    
    ТелоЗапроса = "grant_type=client_credentials&client_id=" + APIKey + "&client_secret=" + SecretKey;
    Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
    
    Ответ = HTTPСоединение.ОтправитьДляОбработки(Запрос);
    Если Ответ.КодСостояния = 200 Тогда
        ЧтениеJSON = Новый ЧтениеJSON;
        ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
        Данные = ПрочитатьJSON(ЧтениеJSON);
        Возврат Данные.access_token;
    Иначе
        Сообщить("Ошибка авторизации!");
        Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область Служебные

Процедура Пауза(КоличествоСекунд)

	Соединение = Новый HTTPСоединение("127.0.0.0", , , , , КоличествоСекунд);
	Попытка    Соединение.Получить(Новый HTTPЗапрос()); Исключение КонецПопытки;

КонецПроцедуры

//Функция РазобратьJSON(Данные)
//    Структура = Новый Структура;
//    Свойство = Неопределено;
//    Значение = Неопределено;
//    ЧтениеJSON = Новый ЧтениеJSON;
//    ЧтениеJSON.УстановитьСтроку(Данные);
//    Пока ЧтениеJson.Прочитать() Цикл
//        ТипJson = ЧтениеJson.ТипТекущегоЗначения;
//        Если ТипJSON = ТипЗначенияJSON.Число Или ТипJson = ТипЗначенияJSON.Строка Или
//            ТипJson = ТипЗначенияJSON.Булево Или ТипJson = ТипЗначенияJSON.Null Тогда
//            Значение = ЧтениеJson.ТекущееЗначение;
//			//Если Свойство = "GUID" Тогда
//			//    Значение = ПреобразоватьВGUID(Значение);
//			//КонецЕсли;   
//			Если Лев(Свойство,1) = "@" Тогда
//				Свойство = Сред(Свойство, 2);	
//			КонецЕсли;
//            Структура.Вставить(Свойство, Значение);
//            //Массив.Добавить(Структура);
//        ИначеЕсли ТипJson = ТипЗначенияJSON.ИмяСвойства Тогда 
//            //Структура.Вставить(Свойство);
//            Свойство = ЧтениеJson.ТекущееЗначение;
//        КонецЕсли;
//    КонецЦикла;
//    Возврат Структура;
//КонецФункции

Процедура РазобратьJSONРекурсия(ЧтениеJSON, Дерево)
    
    ИмяСвойства = Неопределено;
    
    Пока ЧтениеJSON.Прочитать() Цикл
        TипJSON = ЧтениеJSON.ТипТекущегоЗначения;
        
        Если TипJSON = ТипЗначенияJSON.НачалоОбъекта 
        ИЛИ TипJSON = ТипЗначенияJSON.НачалоМассива Тогда
            НовыйОбъект = ?(TипJSON = ТипЗначенияJSON.НачалоОбъекта, Новый Структура, Новый Массив);
            
            Если ТипЗнч(Дерево) = Тип("Массив") Тогда
                Дерево.Добавить(НовыйОбъект);
            ИначеЕсли ТипЗнч(Дерево) = Тип("Структура") И ЗначениеЗаполнено(ИмяСвойства) Тогда
                Дерево.Вставить(ИмяСвойства, НовыйОбъект);
            КонецЕсли;
            
            РазобратьJSONРекурсия(ЧтениеJSON, НовыйОбъект);
            
            Если Дерево = Неопределено Тогда
                Дерево = НовыйОбъект;
            КонецЕсли;
		ИначеЕсли TипJSON = ТипЗначенияJSON.ИмяСвойства Тогда  
            ИмяСвойства = ЧтениеJSON.ТекущееЗначение;
			//+
			Если Лев(ИмяСвойства,1) = "@" Тогда
				ИмяСвойства = Сред(ИмяСвойства, 2);	
			КонецЕсли;
			//-
        ИначеЕсли TипJSON = ТипЗначенияJSON.Число 
        ИЛИ TипJSON = ТипЗначенияJSON.Строка 
        ИЛИ TипJSON = ТипЗначенияJSON.Булево 
        ИЛИ TипJSON = ТипЗначенияJSON.Null Тогда   
			//+
			Если Лев(ИмяСвойства,1) = "@" Тогда
				ИмяСвойства = Сред(ИмяСвойства, 2);	
			КонецЕсли;
			//-
            Если ТипЗнч(Дерево) = Тип("Массив") Тогда
                Дерево.Добавить(ЧтениеJSON.ТекущееЗначение);
            ИначеЕсли ТипЗнч(Дерево) = Тип("Структура") Тогда
                Дерево.Вставить(ИмяСвойства, ЧтениеJSON.ТекущееЗначение);
            КонецЕсли;
        Иначе
            Возврат;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти
